export const commonOptions = {
  buildings: ['1', '2'],
  audiences: ['101', '102', '201', '202', '301', '302', '422', '211', '300'],
  pairs: ['1', '2', '3', '4', '5', '6', '7'],
  reasons: [
    'Больничный', 
    'Отпуск', 
    'Командировка', 
    'Учебный отпуск', 
    'Ремонт', 
    'Уборка', 
    'Мероприятие', 
    'Конференция',
    'Семинар', 
    'Олимпиада',
    'Собрание',
    'Экзамен',
    'Зачет',
    'Культурное мероприятие',
    'Спортивное мероприятие',
    'Технические работы', 
    'Другое'
  ],
  positions: ['Администратор', 'Преподаватель', 'Студент', 'Диспетчер УО'],
  transferOptions: ['Да', 'Нет'],
  statusOptions: ['Не согласовано', 'В ожидании', 'Согласовано'],
  
  dateFormats: {
    display: 'DD.MM.YYYY', 
    input: 'YYYY-MM-DD',  
    storage: 'YYYY-MM-DD'  
  }
};

export const teacherOptions = ['Куракова', 'Черевко', 'Рыбальченко', 'Иванов', 'Петрова'];
export const disciplineOptions = ['Основы философии', 'Математический анализ', 'История', 'Программирование', 'Базы данных'];
export const groupOptions = ['ИС-22', 'ИС-32', 'ИС-12', 'ИС-45', 'ИКС-44'];
export const eventOptions = ['ремонт', 'конкурс', 'собрание', 'мероприятие', 'конференция'];